#### Importing necessary libraries

In [1]:
import pandas as pd

Loading movie titles

In [2]:
columns = [0,1,2]
movies = pd.read_csv(
    "netflix-data/movie_titles.csv",
    encoding="ISO-8859-1",
    usecols=columns
)

In [3]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17770 entries, 0 to 17769
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      17770 non-null  int64
 1   Year    17763 non-null  float64
 2   Title   17770 non-null  object
dtypes: float64(1), int64(1), object(1)
memory usage: 416.6+ KB

Only 7 titles have missing data so they are dropped and years converted to int values

In [4]:
movies.dropna(inplace=True)
movies.Year = movies.Year.astype(int)
movies

          ID  Year                                              Title
0          1  2003                                    Dinosaur Planet
1          2  2004                         Isle of Man TT 2004 Review
2          3  1997                                          Character
3          4  1994                       Paula Abdul's Get Up & Dance
4          5  2004                           The Rise and Fall of ECW
...      ...   ...                                                ...
17765  17766  2002  Where the Wild Things Are and Other Maurice Se...
17766  17767  2004                  Fidel Castro: American Experience
17767  17768  2000                                              Epoch
17768  17769  2003                                        The Company
17769  17770  2003                                       Alien Hunter

[17763 rows x 3 columns]

Loading and exploring ratings

In [7]:
path = "netflix-data/combined_data_1.txt"

movies, users, ratings = [],[],[]

with open(path, "r") as file:
    for line in file:
        line = line.strip()
        if line.endswith(":"):#lines with movie id's end in ":", rest are structured like a csv
            movie = line.rstrip(":")
        elif line:# is not empty
            user, rating, _ = line.split(",")
            movies.append(int(movie))
            users.append(int(user))
            ratings.append(int(rating))

In [8]:
data = {
    "movie":movies,
    "user":users,
    "rating":ratings
}
ratings_df = pd.DataFrame(data)

In [9]:
ratings_df

          movie     user  rating
0             1  1488844       3
1             1   822109       5
2             1   885013       4
3             1    30878       4
4             1   823519       3
...         ...      ...     ...
24053759   4499  2591364       2
24053760   4499  1791000       2
24053761   4499   512536       5
24053762   4499   988963       3
24053763   4499  1704416       3

[24053764 rows x 3 columns]